FV2310/E_0020.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">MaBiS</FONT></B><BR align="left"/><BR/><B><FONT POINT-SIZE="16">7.1.1: AD: Aktivierung eines MaBiS-Zählpunkts für die Netzzeitreihe an NB</FONT></B><BR align="left"/><BR/><BR/><BR/>>;
    ratio="compress";
    concentrate=true;
    pack=true;
    rankdir=TB;
    packmode="array";
    size="20,20";
    "Start" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7a8da1", label=<<B>E_0020</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> NB</B></FONT><BR align="center"/>>];
    "1" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>1: </B>Erfolgt die Aktivierung nach Ablauf der Clearingfrist für die KBKA?<BR align="left"/>>];
    "A01" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A01</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Fristüberschreitung<BR align="left"/></FONT>>];
    "2" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>2: </B>Erfolgt die Aktivierung zum Monatsersten 00:00 Uhr?<BR align="left"/>>];
    "A02" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A02</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Gewählter Zeitpunkt nicht zulässig<BR align="left"/></FONT>>];
    "3" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>3: </B>Wird die ID bereits für die Identifikation eines Nicht-MaBiS-ZP verwendet?<BR align="left"/>>];
    "A03" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A03</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>ID bereits außerhalb MaBiS verwendet<BR align="left"/></FONT>>];
    "4" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>4: </B>Ist genau eines der angegebenen Bilanzierungsgebiete das Bilanzierungsgebiet<BR align="left"/>des Empfängers?<BR align="left"/>>];
    "A04" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A04</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Bilanzierungsgebiet des benachbarten NB nicht gültig<BR align="left"/></FONT>>];
    "5" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>5: </B>Ist die richtige Regelzone angegeben?<BR align="left"/>>];
    "A05" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A05</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Regelzone falsch<BR align="left"/></FONT>>];
    "6" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>6: </B>Ist der Empfänger zum Aktivierungsbeginn für eines der zwei angegebenen<BR align="left"/>Bilanzierungsgebiete zuständig?<BR align="left"/>>];
    "A06" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A06</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Keine Berechtigung<BR align="left"/></FONT>>];
    "7" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>7: </B>Existiert bereits ein abweichendes Tupel unter der ID des MaBiS-ZP?<BR align="left"/>>];
    "A07" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A07</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Abweichender MaBiS-ZP bereits vorhanden<BR align="left"/></FONT>>];
    "8" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>8: </B>Existiert bereits für das genannte Tupel aus Bilanzierungsgebiet des<BR align="left"/>verantwortlichen NB, Bilanzierungsgebiet des benachbarten NB und ZRT eine<BR align="left"/>abweichende ID des MaBiS-ZP?<BR align="left"/>>];
    "A08" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A08</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Abweichende ID zum MaBiS-ZP bereits vorhanden<BR align="left"/></FONT>>];
    "9" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>9: </B>Ist der NB zur Aktivierung des ZRT berechtigt?<BR align="left"/>>];
    "A09" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A09</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>ZRT Aktivierung nicht berechtigt<BR align="left"/></FONT>>];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>10: </B>Passt die OBIS-Kennzahl zum ZRT?<BR align="left"/>>];
    "A10" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A10</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>OBIS nicht passend<BR align="left"/></FONT>>];
    "11" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#7aab8a", label=<<B>11: </B>Ist der MaBiS-ZP zum Zeitpunkt der Aktivierung bereits aktiviert?<BR align="left"/>>];
    "A11" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A11</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>MaBiS-ZP bereits aktiviert<BR align="left"/></FONT>>];
    "A12" [margin="0.17,0.08", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#cfb986", label=<<B>A12</B><BR align="left"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Aktivierung durchgeführt<BR align="left"/></FONT>>];

    "Start" -> "1";
    "1" -> "A01" [label=<<B>JA</B>>, color="#7aab8a"];
    "1" -> "2" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "2" -> "A02" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "2" -> "3" [label=<<B>JA</B>>, color="#7aab8a"];
    "3" -> "A03" [label=<<B>JA</B>>, color="#7aab8a"];
    "3" -> "4" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "4" -> "A04" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "4" -> "5" [label=<<B>JA</B>>, color="#7aab8a"];
    "5" -> "A05" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "5" -> "6" [label=<<B>JA</B>>, color="#7aab8a"];
    "6" -> "A06" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "6" -> "7" [label=<<B>JA</B>>, color="#7aab8a"];
    "7" -> "A07" [label=<<B>JA</B>>, color="#7aab8a"];
    "7" -> "8" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "8" -> "A08" [label=<<B>JA</B>>, color="#7aab8a"];
    "8" -> "9" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "9" -> "A09" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "9" -> "10" [label=<<B>JA</B>>, color="#7aab8a"];
    "10" -> "A10" [label=<<B>NEIN</B>>, color="#7aab8a"];
    "10" -> "11" [label=<<B>JA</B>>, color="#7aab8a"];
    "11" -> "A11" [label=<<B>JA</B>>, color="#7aab8a"];
    "11" -> "A12" [label=<<B>NEIN</B>>, color="#7aab8a"];

    bgcolor="transparent";
}
